namespace ContainerFather.Core.Enums.SiteEnums;

public enum CategoryEnum
{
// --- Морские и ЖД контейнеры ---
    МорскиеИЖДКонтейнеры = 5,
    Контейнеры10Футов = 6,
    Контейнеры20Футов = 7,
    Контейнеры40Футов = 8,
    Контейнеры45Футов = 9,
    Контейнеры5Тонн = 24,
    Контейнеры3Тонны = 25,

// --- High Cube контейнеры ---
    HighCubeКонтейнеры = 53,
    HighCubeКонтейнеры20Футов = 54,
    HighCubeКонтейнеры40Футов = 55,

// --- Open Top контейнеры ---
    OpenTopКонтейнеры = 17,
    OpenTopКонтейнеры20Футов = 18,
    OpenTopКонтейнеры40Футов = 19,

// --- Flat Rack контейнеры ---
    FlatRackКонтейнеры = 20,
    FlatRackКонтейнеры20Футов = 21,
    FlatRackКонтейнеры40Футов = 22,

// --- Рефрижераторные контейнеры ---
    РефрижераторныеКонтейнеры = 10,
    Рефконтейнеры20Футов = 13,
    Рефконтейнеры40Футов = 12,
    Рефконтейнеры45Футов = 11,

// --- Танк-контейнеры ---
    ТанкКонтейнеры = 14,
    ТанкКонтейнеры20Футов = 16,
    ТанкКонтейнеры40Футов = 15,

// --- Бытовки ---
    Бытовки = 26,
    ДеревянныеБытовки = 32,
    МеталлическиеБытовки = 33,
    ДачныеБытовки = 28,
    СтроительныеБытовки = 27,
    УтепленныеБытовки = 56,
    БытовкиВагончики = 29,
    БытовкиБани = 30,

// --- Прочие строения ---
    МодульныеЗдания = 31,
    БлокКонтейнеры = 34,

// --- Мусорные контейнеры ---
    МусорныеКонтейнеры = 35,
    МультилифтКонтейнеры = 36,
    БункерКонтейнеры = 37,
    До1_3М3 = 39,
    От8М3 = 57,
    УрныДо0_5М3 = 40,
    ПрессКонтейнеры = 41,

// --- Запчасти и Услуги ---
    ЗапчастиДляКонтейнеров = 42,
    Услуги = 43,
    Перевозка = 44,
    Аренда = 45,
    Ремонт = 46,
    Хранение = 47,
    Страхование = 48,

// --- Инфо и Прочее ---
    НовостиСобытияВыставки = 49,
    ТерминалыПлощадкиСклады = 50,
    Прочее = 51,
    РекламныеОбъявления = 52
}